app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "One"], ["description", "Test"], ["image_url", "not an url"], ["created_at", "2017-05-23 08:13:40.308147"], ["updated_at", "2017-05-23 08:13:40.308147"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save